Repository: MrGottham/789fe44a87d4
Catalog: DsiNext.DeliveryEngine/DsiNext.DeliveryEngine.Resources/ExceptionMessages.*.resx
Languages: da_dk

# ApplicationSettingMissing
source: The application setting key '{0}' is missing or has an illegal value.
da_dk: Nøglen '{0}' mangler som applikationskonfiguration i konfigurationsfilen eller nøglen har en ugyldig værdi.

# DataSourceAlreadySet
source: The DataSource was already set.
da_dk: DataSource kan ikke ændres.

# DataSourceNotSet
source: The DataSource was not set.
da_dk: DataSource er ikke defineret.

# DataTypeNotSupported
source: The DataType is not supported: {0}
da_dk: DataTypen er ikke understøttet: {0}

# DirectoryCreateError
source: The folder could not be created: {0}
da_dk: Mappen kunne ikke oprettes: {0}

# DirectoryNotFound
source: Directory not found: {0}
da_dk: Directory eksisterer ikke: {0}

# ErrorHandleException
source: Error while handling exception: {0}
da_dk: Fejl under håndtering af exception: {0}

# ErrorReadingFieldValue
source: Error while reading value for the field named '{0}' in the table named '{1}': {2}
da_dk: Fejl ved læsning af værdi til feltet '{0}' i tabellen '{1}': {2}

# ExistingMappingRule
source: Rule already exists: {0} -> {1}
da_dk: Reglen eksisterer allerede: {0} -> {1}

# FieldNotFound
source: Field not found: {0}
da_dk: Felt eksisterer ikke: {0}

# FieldNotFoundOnTable
source: The field named '{0}' does not exist on the table named '{1}'.
da_dk: Feltet '{0}' eksisterer ikke på tabellen '{1}'.

# FieldNotFoundOnType
source: The field named '{0}' does not exist on the type '{1}'.
da_dk: Variablen '{0}' findes ikke på typen '{1}'.

# FieldTableMismatch
source: The field table does not match the expected: {0} != {1}
da_dk: Feltets tabel matcher ikke det forventede: {0} != {1}

# FileCopyError
source: The file could not be copied: {0} -> {1}
da_dk: Filen kunne ikke kopieres: {0} -> {1}

# FileNotFound
source: File not found: '{0}'
da_dk: Filen eksisterer ikke: '{0}'

# FileWriteError
source: The file could not be created: {0}
da_dk: Filen kunne ikke oprettes: {0}

# IllegalValue
source: The value '{0}' is illegal for '{1}'.
da_dk: Værdien '{0}' er ugyldig for '{1}'.

source: Invalid cardinality.
da_dk: Ugyldig kardinalitet.

# InvalidChildNodeCount
source: Invalid count of child nodes named '{0}' on the node '{1}'.
da_dk: Ugyldig antal noder med navnet '{0}' under noden '{1}'.

# InvalidFieldLength
source: Invalid field length: {0}
da_dk: Ugyldig felt længde: {0}

# InvalidFilterValue
source: The filter value '{0}' does not match the pattern '{1}'.
da_dk: Filterværdien '{0}' matcher ikke mønstret '{1}'.

# InvokeError
source: Error while invoking {0}.{1}: {2}
da_dk: Fejl ved udførelse af {0}.{1}: {2}

# MapByDictionaryFailed
source: Mapping by dictionary failed: {0}
da_dk: Konvertering vha. ordbog fejlede: {0}

# MapByReflectionFailed
source: Mapping by reflection failed: {0}.{1}({2})
da_dk: Konvertering vha. reflektion fejlede: {0}.{1}({2})

# MapByTypeCastFailed
source: Mapping by type cast failed: ({0}) '{1}'
da_dk: Konvertering vha. type cast fejlede: ({0}) '{1}'

# MethodNotFoundOnType
source: The method named '{0}' does not exist on the type '{1}'.
da_dk: Metoden '{0}' findes ikke på typen '{1}'.

# MissingCandidateKeyOnForeignKey
source: Missing candidate key on the foreign key named '{0}' in the table named '{1}'.
da_dk: Kandidatnøglen til fremmednøglen '{0}' er ikke defineret på tabellen '{1}'.

# MissingCandidateKeysOnTable
source: Missing candidate keys on the table named '{0}'.
da_dk: Kandidatnøgler er ikke defineret på tabellen '{0}'.

# MissingChildNode
source: There are no child node named '{0}' on the node '{1}'.
da_dk: Der findes ikke én node med navnet '{0}' under noden '{1}'.

# MissingFieldsOnCandidateKey
source: Missing fields on the candidate key named '{0}' on the table named '{1}'.
da_dk: Felter er ikke defineret på kandidatnøglen '{0}' på tabellen '{1}'.

# NamedConnectionStringMissing
source: The connection string named '{0}' is missing or has an illegal value in the application configuration file.
da_dk: Connection strengen med navnet '{0}' mangler eller har en ugyldig værdi i konfigurationsfilen.

# ParseError
source: Error while parsing {0}.Parse({1}): {2}
da_dk: Fejl under konvertering af {0}.Parse({1}): {2}

# PropertyNotFoundOnType
source: The property name '{0}' does not exist on the type '{1}'.
da_dk: Egenskaben '{0}' findes ikke på typen '{1}'.

# RepositoryError
source: Error in repository method '{0}': {1}
da_dk: Fejl i repositorymetode '{0}': {1}

# ResourceNotFound
source: Embedded resource was not found: {0}
da_dk: Indlejret resource blev ikke fundet: {0}

# TableNotFound
source: Table not found: {0}
da_dk: Tabel eksisterer ikke: {0}

# TooManyForeignKeyRelationships
source: There are more than one relationship for the foreign key named '{0}' in the table named '{1}': {2}
da_dk: Der findes mere end én relationspost til fremmednøglen '{0}' på tabellen '{1}': {2}

# TypeMismatch
source: Mismatch between types: '{0}' and '{1}' in '{2}'
da_dk: Uoverensstemmelse mellem typer: '{0}' og '{1}' i '{2}'

# UnableToCreateCriteria
source: Unable to create an instance of the criteria '{0}': {1}
da_dk: Kunne ikke danne en instans af kriteriet '{0}': {1}

# UnableToCreateInstanceOfType
source: Unable to create an instance of '{0}'.
da_dk: Kan ikke initierer en instans af typen '{0}'.

# UnableToFindForeignKeyRelationship
source: Unable to find relationships for the foreign key named '{0}' in the table named '{1}': {2}
da_dk: Kunne ikke finde relationspost i fremmednøglen '{0}' på tabellen '{1}': {2}

# UnableToFindMatchingKey
source: Unable to find matching key on table '{0}'.
da_dk: Kan ikke finde en matchende nøgle på tabellen med navnet '{0}'.

# UnableToGetDataQueryer
source: Unable to get data queryer for the data repository '{0}': {1}
da_dk: Kunne ikke få en dataforespørger til datarepositoryet '{0}': {1}

# UnableToGetValueForField
source: Unable to get value for the field named '{0}' on the table named '{1}': {2}
da_dk: Kunne ikke beregne værdien til feltet '{0}' på tabellen '{1}': {2}

# UnableToMapDataTypeFromDatabase
source: Unable to map the data type '{0}' to '{1}' on the field named '{2}' in the table named '{3}'.
da_dk: Kan ikke mappe datatypen '{0}' til '{1}' på feltet '{2}' i tabellen '{3}'.

# UnableToMapValueForField
source: Unable to map the value '{0}' for the field named '{1}' on the table named '{2}': {3}
da_dk: Kunne ikke mappe værdien '{0}' til feltet '{1}' på tabellen '{2}': {3}

# UnableToMatchFieldsOnForeignKey
source: Unable to match fields on the candidate key named '{0}' with fields on the foreign key named '{1}' in the table named '{2}.
da_dk: Kunne ikke matche felter i kandidatnøglen '{0}' med felter i fremmednøglen '{1}' på tabellen '{2}.

# UnableToParseValueForField
source: Unable to parse the value '{0}' for the field named '{1}' on the table named '{2}': {3}
da_dk: Kunne ikke opløse værdien '{0}' til feltet '{1}' i tabellen '{2}': {3}

# UniqueConstraintViolationOnCandidateKey
source: Unique constraint violation on the candidate key named '{0}'.
da_dk: Kandidatnøglen '{0}' medfører ens nøgler.

# XmlValidationError
source: An error occurred when validating the XML: {0}
da_dk: Der opstod en fejl ved validering af XML: {0}
