Repository: MrGottham/789fe44a87d4
Catalog: DsiNext.DeliveryEngine/DsiNext.DeliveryEngine.Resources/Texts.*.resx
Languages: da_dk

# BeforeArchiveDataForTargetTableInformation
source: Writes data in data block number {0} ({1} rows) from table: {2}. Please wait...
da_dk: Skriver data i blok {0} ({1} rækker) fra tabellen: {2}. Vent venligst...

# BeforeArchiveMetadataInformation
source: Writes the metadata for {0}. Please wait...
da_dk: Skriver metadata for {0}. Vent venligst...

# BeforeGetDataForTargetTableInformation
source: Gets data in data block number {0} for table: {1}. Please wait...
da_dk: Henter data fra blok {0} for tabellen: {1}. Vent venligst...

# BeforeGetDataSourceInformation
source: Gets the data source and metadata. Please wait...
da_dk: Henter datakilde og metadata. Vent venligst...

# BeforeValidateDataInTargetTableInformation
source: Validates data in data block number {0} ({1} rows) from table: {2}. Please wait...
da_dk: Validerer data i blok {0} ({1} rækker) fra tabellen: {2}. Vent venligst...

source: Class
da_dk: Klasse

# ErrorMessage
source: Error: {0}
da_dk: Fejl: {0}

# ForeignKeyCleanerInformation
source: '{0}' has cleaned {1} rows for missing foreign key values on the table '{2}' throug the foreign key '{3}'.
da_dk: '{0}' har nulstillet {1} rækker for manglende fremmednøgle værdier i tabellen '{2}' gennem fremmednøglen '{3}'.

# ForeignKeyDeleterInformation
source: '{0}' has deleted {1} rows for missing foreign key values on the table '{2}' throug the foreign key '{3}'.
da_dk: '{0}' har slettet {1} rækker for manglende fremmednøgle værdier i tabellen '{2}' gennem fremmednøglen '{3}'.

source: Method
da_dk: Metode

# PrimaryKeyAdderInformation
source: '{0}' has added {1} rows as missing primary values on the table '{2}' through the foreign key '{3}'.
da_dk: '{0}' har tilføjet {1} rækker, som primære værdier i tabellen '{2}' gennem fremmednøglen '{3}'.

source: Thread
da_dk: Tråd

# UsageArchiveMaker
source: Usage: {0} [/ArchiveInformationPackageID:[ID]] [/ValidationOnly:[true | false]] [/TablesHandledSimultaneity:[Number]] [/AcceptWarnings:[Number]] [/RemoveMissingRelationshipsOnForeignKeys:[true | false]] [/NumberOfForeignTablesToCache:[Number]]
da_dk: Syntaks: {0} [/ArchiveInformationPackageID:[ID]] [/ValidationOnly:[true | false]] [/TablesHandledSimultaneity:[Antal]] [/AcceptWarnings:Antal]] [/RemoveMissingRelationshipsOnForeignKeys:[true | false]] [/NumberOfForeignTablesToCache:[Antal]] [/IncludeEmptyTables:[true | false]]
